cf_billing/Documents/энргОбходнойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОбходнойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеДляТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргОбходнойЛист/Forms/ФормаПоискаЛС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		ТекОрганизация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("Район") Тогда
		ТекРайон = Параметры.Район;
	КонецЕсли;
	Если Параметры.Свойство("Строение") Тогда
		ТекСтроение = Параметры.Строение;
	КонецЕсли;
	Если Параметры.Свойство("Контроллер") Тогда
		ТекКонтроллер = Параметры.Контроллер;
	КонецЕсли;
	Если Параметры.Свойство("Маршрут") Тогда
		ТекМаршрут = Параметры.Маршрут;
	КонецЕсли;
	Параметры.Свойство("ФИО", ФИО);
	АвтоВыбор = Параметры.Свойство("ИдТекСтроки", ИдТекСтроки);
	
	Период = Неопределено;
	Параметры.Свойство("Период", Период);
	Период = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДата());
	Абоненты.Параметры.УстановитьЗначениеПараметра("Период", Период);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборВСпискеАбонентов();
	
	Если АвтоВыбор Тогда
		Элементы.ФИО.Видимость			  = Ложь;
		Элементы.ФИО_АвтоПодбор.Видимость = Истина;		

		Результат = ПолучитьДанныеПоСписку();
		Если Результат <> 0 Тогда
			//Отказ = Истина;
			//Оповестить("НайденЛС", Результат);
			ОповеститьОВыборе(Результат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Закрыть(Новый Структура("Абонент,КлючПомещения",ВыбранноеЗначение.Абонент,ВыбранноеЗначение.КлючПомещения));
КонецПроцедуры

&НаКлиенте
Процедура АбонентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	Закрыть(Новый Структура("Абонент,КлючПомещения, ИдТекСтроки",ВыбраннаяСтрока.Абонент,ВыбраннаяСтрока.КлючПомещения, ИдТекСтроки));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.Абоненты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("Абонент,КлючПомещения, ИдТекСтроки",ТекущиеДанные.Абонент,ТекущиеДанные.КлючПомещения, ИдТекСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	ФИО 		= "";
	Город 		= "";
	Улица 		= "";
	НомерДома 	= "";
	Помещение 	= "";
	Строение 	= "";
	
	ЭтаФорма.Элементы.ФИО.ОбновитьТекстРедактирования();
	ЭтаФорма.Элементы.Строение.ОбновитьТекстРедактирования();
	ЭтаФорма.Элементы.Помещение.ОбновитьТекстРедактирования();

	УстановитьОтборВСпискеАбонентов();
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборВСпискеАбонентов()
		
	Абоненты.Отбор.Элементы.Очистить();
	
	отборЭтоГруппа 								=  Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	отборЭтоГруппа.ЛевоеЗначение 				= Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	отборЭтоГруппа.ПравоеЗначение 				= Ложь;
	отборЭтоГруппа.ВидСравнения 				= ВидСравненияКомпоновкиДанных.Равно;
	
	отборЭтоГруппа 								=  Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	отборЭтоГруппа.ЛевоеЗначение 				= Новый ПолеКомпоновкиДанных("Организация");
	отборЭтоГруппа.ПравоеЗначение 				= ТекОрганизация;
	отборЭтоГруппа.ВидСравнения 				= ВидСравненияКомпоновкиДанных.Равно;	
	
	Если ЗначениеЗаполнено(ТекСтроение) Тогда
		отборЭтоГруппа 							=  Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		отборЭтоГруппа.ЛевоеЗначение 			= Новый ПолеКомпоновкиДанных("Строение");
		отборЭтоГруппа.ПравоеЗначение 			= ТекСтроение;
		отборЭтоГруппа.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекРайон) Тогда 
		отборЭтоГруппа 							=  Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		отборЭтоГруппа.ЛевоеЗначение 			= Новый ПолеКомпоновкиДанных("Район");
		отборЭтоГруппа.ПравоеЗначение 			= ТекРайон;
		отборЭтоГруппа.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФИО) тогда
		ЭтоЛС 									= СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(ФИО,3),Истина,Истина); 
		Если ЭтоЛС тогда		
			ОтборГруппа  						= Абоненты.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ОтборГруппа.ТипГруппы 				= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			ОтборЛС  							= ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЛС.ЛевоеЗначение 				= Новый ПолеКомпоновкиДанных("ЛицевойСчет");
			ОтборЛС.ПравоеЗначение 				= ФИО;
			ОтборЛС.ВидСравнения 				= ВидСравненияКомпоновкиДанных.Содержит;		
			
			ОтборстарыйЛС  						= ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборстарыйЛС.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("СтарыйЛС");
			ОтборстарыйЛС.ПравоеЗначение 		= ФИО;
			ОтборстарыйЛС.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит; 		
		иначе
			ОтборНаименование 					=  Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборНаименование.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Наименование");
			ОтборНаименование.ПравоеЗначение	= ФИО;
			ОтборНаименование.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Содержит;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Строение) тогда		
			ОтборАдрес 							= Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборАдрес.ЛевоеЗначение 			= Новый ПолеКомпоновкиДанных("СтроениеНаименование");
			ОтборАдрес.ПравоеЗначение			= Строение;
			ОтборАдрес.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Помещение) тогда		
		ОтборАдрес 							= Абоненты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборАдрес.ЛевоеЗначение 			= Новый ПолеКомпоновкиДанных("Помещение");
		ОтборАдрес.ПравоеЗначение			= Помещение;
		ОтборАдрес.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Равно;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоСписку()

	Схема = Элементы.Абоненты.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Абоненты.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Если Результат.Количество() = 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден лицевой счёт.");
		Возврат Неопределено;
	ИначеЕсли Результат.Количество() = 1 Тогда
		Возврат Новый Структура("Абонент,КлючПомещения, ИдТекСтроки", Результат[0].Абонент, Результат[0].Абонент.КлючПомещения, ИдТекСтроки);
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбновитьОтбор(Элемент)
	УстановитьОтборВСпискеАбонентов();
КонецПроцедуры

#КонецОбласти
